Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesToCircuit Property
 Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchNmbOfPolesToCircuit { get; }
Public Shared ReadOnly Property MismatchNmbOfPolesToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchNmbOfPolesToCircuit {
	FailureDefinitionId^ get ();
}
static member MismatchNmbOfPolesToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace